Tekla.Structures.DirectManipulation.Adapter.Session.PlaneJsonConverter
The Tekla.Structures.DirectManipulation.Adapter.Session.PlaneJsonConverter class is used to convert the Tekla.Common.Geometry.Plane3 from/to JSON.

Tekla.Structures.DirectManipulation.Adapter.Session.PlaneJsonConverter.SupportedTypes
Gets the supported types.

Tekla.Structures.DirectManipulation.Adapter.Session.PlaneJsonConverter.ReadJson(Newtonsoft.Json.JsonReader,System.Type,System.Object,Newtonsoft.Json.JsonSerializer)
Reads the JSON representation of the object.
reader: The Newtonsoft.Json.JsonReader to read from.
objectType: Type of the object.
existingValue: The existing value of object being read.
serializer: The calling serializer.
Returns: The object value.